## Staging Plan for integration_test
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 6 to add, 0 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.integration_test.data.aws_iam_policy_document.s3_scan_object will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_scan_object"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:127893201980:function:s3-scan-object",
            ]
        }
    }

  # module.integration_test.aws_cloudwatch_log_group.s3_scan_object will be created
  + resource "aws_cloudwatch_log_group" "s3_scan_object" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/s3-scan-object-integration-test"
      + retention_in_days = 7
      + tags              = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
    }

  # module.integration_test.aws_iam_policy.s3_scan_object will be created
  + resource "aws_iam_policy" "s3_scan_object" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "S3ScanObject-integration-test"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.integration_test.aws_iam_role_policy_attachment.s3_scan_object will be created
  + resource "aws_iam_role_policy_attachment" "s3_scan_object" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "S3ScanObject-integration-test"
    }

  # module.integration_test.aws_lambda_function.s3_scan_object is tainted, so must be replaced
-/+ resource "aws_lambda_function" "s3_scan_object" {
      ~ architectures                  = [] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:127893201980:function:s3-scan-object-integration-test" -> (known after apply)
      ~ id                             = "s3-scan-object-integration-test" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:127893201980:function:s3-scan-object-integration-test/invocations" -> (known after apply)
      ~ last_modified                  = "2022-07-12T19:49:48.665+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:127893201980:function:s3-scan-object-integration-test:$LATEST" -> (known after apply)
      ~ reserved_concurrent_executions = -1 -> 3
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_size               = 606 -> (known after apply)
        tags                           = {
            "CostCentre" = "scan-files-staging"
            "Terraform"  = "true"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (11 unchanged attributes hidden)


      ~ ephemeral_storage {
          ~ size = 512 -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.integration_test.aws_lambda_permission.s3_execute will be created
  + resource "aws_lambda_permission" "s3_execute" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "s3-scan-object-integration-test"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = "arn:aws:s3:::scan-files-staging-integration-test"
      + statement_id        = "S3ScanObjectS3Invoke-integration-test"
      + statement_id_prefix = (known after apply)
    }

  # module.integration_test.aws_s3_bucket_notification.s3_scan_object will be created
  + resource "aws_s3_bucket_notification" "s3_scan_object" {
      + bucket      = "scan-files-staging-integration-test"
      + eventbridge = false
      + id          = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + id                  = "ScanObjectCreated"
          + lambda_function_arn = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.integration_test_bucket.aws_s3_bucket.this,
  on .terraform/modules/integration_test_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_versioning resource instead

(and 10 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.integration_test.aws_iam_policy.s3_scan_object"]
WARN - plan.json - main - Missing Common Tags: ["module.integration_test.aws_iam_role.s3_scan_object"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
